Repository: Electric-Coin-Company/zashi-ios
Catalog: modules/Sources/Generated/Resources/*.lproj/Localizable.strings
Languages: es

# about.additionalInfo
source: Built by Zcashers, for Zcashers. Developed and maintained by Electric Coin Co., the inventor of Zcash, Zashi features a built-in user-feedback mechanism to enable more features, more quickly.
es: Desarrollada por el equipo que continúa marcando el estándar de la industria en privacidad blockchain, los desarrolladores originales del protocolo Zcash en Electric Coin Company.

# about.title
source: Introducing Zashi
es: Presentando Zashi

# about.privacyPolicy
source: Privacy Policy
es: Política de privacidad

# addressBook.error.addressExists
source: This wallet address is already in your Address Book.
es: Ya existe una dirección con esta cadena en tu libreta de direcciones.
