Repository: Electric-Coin-Company/zashi-ios
Catalog: modules/Sources/Generated/Resources/*.lproj/Localizable.strings
Languages: es

# transactionList.noMessageIncluded
source: No message included in transaction
es: No se incluyó ningún mensaje en la transacción

# transactionList.transactionFee
source: Transaction Fee
es: Tarifa de Transacción

# transactionList.transactionId
source: Transaction ID
es: ID de Transacción

# transactionList.noTransactions
source: No transaction history
es: Sin historial de transacciones

# transaction.sent
source: Sent
es: Enviado

# transaction.sending
source: Sending
es: Enviando

# transaction.receiving
source: Receiving
es: Recibiendo

# transaction.received
source: Received
es: Recibido

# transaction.failedSend
source: Send failed
es: Envío fallido

# transaction.failedReceive
source: Receive failed
es: Recepción fallida

# transaction.shieldingFunds
source: Shielding
es: Protegiendo

# transaction.failedShieldedFunds
source: Shielded Funds Failed
es: Fondos Protegidos Fallidos

# transaction.saveAddress
source: Save address
es: Guardar dirección

# transaction.selectText
source: Select text
es: Seleccionar texto

# transaction.shieldedFunds
source: Shielded
es: Protegidos

# localAuthentication.reason
source: The Following content requires authentication.
es: El siguiente contenido requiere autenticación.

# supportData.timeItem.time
source: Current time
es: Hora actual

# supportData.appVersionItem.bundleIdentifier
source: App identifier
es: Identificador de la aplicación

# supportData.appVersionItem.version
source: App version
es: Versión de la aplicación

# supportData.systemVersionItem.version
source: iOS version
es: Versión de iOS

# supportData.deviceModelItem.device
source: Device
es: Dispositivo

# supportData.localeItem.locale
source: Locale
es: Región

# supportData.localeItem.groupingSeparator
source: Currency grouping separator
es: Separador de agrupación de moneda

# supportData.localeItem.decimalSeparator
source: Currency decimal separator
es: Separador decimal de moneda

# supportData.freeDiskSpaceItem.freeDiskSpace
source: Usable storage
es: Almacenamiento disponible

# supportData.permissionItem.permissions
source: Permissions
es: Permisos

# supportData.permissionItem.camera
source: Camera access
es: Acceso a la cámara

# supportData.permissionItem.faceID
source: FaceID available
es: FaceID disponible

# supportData.permissionItem.touchID
source: TouchID available
es: TouchID disponible

# root.initialization.alert.failed.title
source: Wallet initialisation failed.
es: Falló la inicialización de la billetera.

# root.initialization.alert.sdkInitFailed.title
source: Failed to initialize the SDK
es: No se pudo inicializar el SDK

# root.initialization.alert.walletStateFailed.message
source: App initialisation state: %@.
es: Estado de inicialización de la aplicación: %@.

# root.initialization.alert.cantLoadSeedPhrase.message
source: Can't load seed phrase from local storage.
es: No se puede cargar la frase semilla desde el almacenamiento local.

# root.initialization.alert.cantCreateNewWallet.message
source: Can't create new wallet. Error: %@
es: No se puede crear una nueva billetera. Error: %@

# root.initialization.alert.cantStoreThatUserPassedPhraseBackupTest.message
source: Can't store information that user passed phrase backup test. Error: %@
es: No se puede almacenar la información de que el usuario pasó la prueba de respaldo de frase. Error: %@

# root.initialization.alert.wipe.title
source: Wipe of the wallet
es: Borrado de la billetera

# root.initialization.alert.wipe.message
source: Are you sure?
es: ¿Estás seguro?

# root.initialization.alert.wipeFailed.title
source: Wallet deletion failed.
es: La eliminación de la billetera falló

# root.initialization.alert.wipeFailed.message
source: Wallet deletion only partially succeeded. Please retry to finish the resetting process.
es: La eliminación de la billetera solo tuvo éxito parcialmente. Por favor, intenta de nuevo para completar el proceso de restablecimiento.

# root.destination.alert.failedToProcessDeeplink.title
source: Failed to process deeplink.
es: No se pudo procesar el enlace profundo.

# root.destination.alert.failedToProcessDeeplink.message
source: Deeplink: (%@)) Error: (%@) (code: %@)
es: Enlace profundo: (%@)) Error: (%@) (código: %@)

# root.debug.title
source: Support options
es: Opciones de soporte

# root.debug.navigationTitle
source: Startup
es: Inicio

# root.debug.option.rescanBlockchain
source: Rescan Blockchain
es: Reescanear Blockchain

# root.debug.option.copySeed
source: Copy seed to pasteboard
es: Copiar frase semilla al portapapeles

# root.debug.option.nukeWallet
source: [Be careful] Nuke Wallet
es: [Ten cuidado] Borrar billetera

# root.debug.option.exportLogs
source: Export Logs
es: Exportar registros

# root.debug.option.appReview
source: Rate the App
es: Califica la aplicación

# root.debug.dialog.rescan.title
source: Rescan
es: Reescanear

# root.debug.dialog.rescan.message
source: Select the rescan you want
es: Selecciona el reescaneo que deseas

# root.debug.dialog.rescan.option.quick
source: Quick rescan
es: Reescaneo rápido

# root.debug.dialog.rescan.option.full
source: Full rescan
es: Reescaneo completo

# root.debug.alert.rewind.failed.title
source: Rewind failed
es: El rebobinado falló

# root.debug.alert.rewind.cantStartSync.title
source: Can't start sync process after rewind
es: No se puede iniciar el proceso de sincronización después del rebobinado

# root.seedPhrase.differentSeed.tryAgain
source: Try Again
es: Intentar de nuevo

# root.seedPhrase.differentSeed.message
source: This recovery phrase doesn't match the Zashi database backup saved on this device. If you proceed, you will lose access to this database backup and if you try to restore later, some information may be lost.
es: Esta frase de recuperación no coincide con la copia de seguridad de la base de datos de Zashi guardada en este dispositivo. Si continúas, perderás acceso a esta copia de seguridad de la base de datos y si intentas restaurarla más tarde, se podría perder información.

# root.existingWallet.restore
source: Restore
es: Restaurar

# root.existingWallet.Message
source: We identified a Zashi database backup on this device. If you create a new wallet, you will lose access to this database backup and if you try to restore later, some information may be lost.
es: Identificamos una copia de seguridad de la base de datos de Zashi en este dispositivo. Si creas una nueva billetera, perderás acceso a esta copia de seguridad de la base de datos y si intentas restaurarla más tarde, se podría perder información.

# root.serviceUnavailable.switchServer
source: Switch server
es: Cambiar servidor

# root.serviceUnavailable.Message
source: Your current server is experiencing difficulties. Check your device connection, and/or navigate to Advanced Settings to choose a different server.
es: Tu servidor actual está experimentando dificultades. Verifica la conexión de tu dispositivo y/o navega a Configuración Avanzada para elegir un servidor diferente.

# exportLogs.alert.failed.title
source: Error when exporting logs
es: Error al exportar registros

# addressBook.title
source: Address Book
es: Libreta de Direcciones

# addressBook.newContact.title
source: Add New Address
es: Agregar nueva dirección

# addressBook.newContact.address
source: Wallet Address
es: Dirección de la billetera

# addressBook.newContact.addressPlaceholder
source: Enter wallet address...
es: Ingresa la dirección de la billetera...

# addressBook.newContact.name
source: Contact Name
es: Nombre del contacto

# addressBook.newContact.namePlaceholder
source: Enter contact name...
es: Ingresa el nombre del contacto...

# addressBook.error.nameExists
source: This contact name is already in use. Please choose a different name.
es: Este nombre de contacto ya está en uso. Por favor, elige un nombre diferente.

# addressBook.error.nameLength
source: This contact name exceeds the 32-character limit. Please shorten the name.
es: Este nombre de contacto supera el límite de 32 caracteres. Por favor, acorta el nombre.

# addressBook.error.invalidAddress
source: Invalid address.
es: Dirección no válida.

# addressBook.alert.title
source: Are you sure?
es: ¿Estás seguro?

# addressBook.alert.message
source: You are about to delete this contact. This cannot be undone.
es: Estás a punto de eliminar este contacto. Esto no se puede deshacer.

# addressBook.empty
source: Your address book is empty
es: Tu libreta de direcciones está vacía

# addressBook.selectRecipient
source: Select recipient
es: Seleccionar destinatario

# addressBook.scanAddress
source: Scan QR code
es: Escanear código QR

# addressBook.manualEntry
source: Manual Entry
es: Entrada manual

# addressBook.addNewContact
source: Add New Contact
es: Agregar nuevo contacto

# addressBook.savedAddress
source: Saved Address
es: Dirección guardada

# currencyConversion.title
source: Currency Conversion
es: Conversión de Moneda

# currencyConversion.cardTitle
source: New Feature
es: Nueva Función

# currencyConversion.cardButton
source: Review
es: Revisar

# currencyConversion.learnMoreDesc
source: View your balance and payment amounts in USD. You can manage this feature in Advanced Settings.
es: Muestra tu saldo y los montos de pago en USD. Puedes gestionar esta función en Configuración Avanzada.

# currencyConversion.settingsDesc
source: View your balance and payment amounts in USD with added privacy. Exchange rates are fetched over Tor to protect your IP address.
es: Mira tu saldo y pagos en USD con mayor seguridad. Las tasas de cambio son obtenidas a travez de Tor para proteger tu dirección IP.

# currencyConversion.settingsDesc2
source: Check if Tor use is permitted in your region before enabling.
es: Verifica si Tor está permitido en tu región antes de habilitarlo.

# currencyConversion.enable
source: Enable
es: Habilitar

# currencyConversion.learnMoreOptionEnableDesc
source: Show me the currency conversion.
es: Mostrarme la conversión de moneda.

# currencyConversion.learnMoreOptionDisable
source: Disable
es: Deshabilitar

# currencyConversion.learnMoreOptionDisableDesc
source: Don’t show the currency conversion.
es: No mostrar la conversión de moneda.

# currencyConversion.note
source: Note for the super privacy-conscious: Because we pull the conversion rate from exchanges, an exchange might be able to see that the exchange rate was queried before a transaction occurred.
es: Nota para los más conscientes de la privacidad: Debido a que obtenemos la tasa de conversión de los intercambios, un intercambio podría ver que la tasa de cambio fue consultada antes de que ocurriera una transacción.

# currencyConversion.saveBtn
source: Save changes
es: Guardar cambios

# currencyConversion.ipTitle
source: IP Address Protection
es: Protección de Dirección IP

# currencyConversion.ipDesc
source: Exchange rates are fetched over Tor to protect your IP address. Ensure Tor use is allowed in your region.
es: Las tasas de cambio son obtenidas a travez de Tor para proteger tu dirección IP. Verifica si el uso de Tor esta permitido en tu region.

# currencyConversion.refresh
source: Rate Refresh
es: Actualizar tasa

# currencyConversion.refreshDesc
source: The rate is refreshed automatically and can also be refreshed manually.
es: La tasa se actualiza automáticamente y también se puede actualizar manualmente.

# deeplinkWarning.title
source: Looks like you used a third-party app to scan for payment.
es: Parece que utilizaste una aplicación de terceros para escanear un pago.

# deeplinkWarning.desc
source: For better safety and security, rescan the QR code with Zashi.
es: Para mayor seguridad y protección, vuelve a escanear el código QR con Zashi.

# deeplinkWarning.cta
source: Rescan in Zashi
es: Reescanear en Zashi

# deeplinkWarning.screenTitle
source: Hello!
es: ¡Hola!

# splash.authTitle
source: Your Zashi account is secured.
es: Tu cuenta Zashi está protegida.

# splash.authFaceID
source: Tap the face icon to use Face ID and unlock it.
es: Toca el ícono de la cara para usar Face ID y desbloquear.

# splash.authTouchID
source: Tap the print icon to use Touch ID and unlock it.
es: Toca el ícono de la huella para usar Touch ID y desbloquear.

# splash.authPasscode
source: Tap the key icon to enter your passcode and unlock it.
es: Toca el ícono de la llave para ingresar tu código y desbloquear.

# tooltip.exchangeRate.title
source: Exchange rate unavailable
es: Tasa de cambio no disponible

# tooltip.exchangeRate.desc
source: We tried but we couldn’t refresh the exchange rate for you. Check your connection, relaunch the app, and we’ll try again.
es: Lo intentamos pero no pudimos actualizar la tasa de cambio para ti. Verifica tu conexión, reinicia la aplicación e intentaremos de nuevo.

# component.maxPrivacy
source: Private
es: Privado

# component.lowPrivacy
source: Not Private
es: Público

# partners.flexa.transactionFailedTitle
source: Transaction Failed
es: Transacción Fallida

# partners.flexa.transactionFailedMessage
source: We're sorry but something has failed. Please try again.
es: Lo sentimos, pero algo falló. Por favor, inténtalo de nuevo.

source: Keystone Wallet
es: Billetera Keystone

# keystone.drawer.title
source: Wallets & Hardware
es: Billeteras y Hardware

# keystone.connect
source: Connect Hardware Wallet
es: Conectar Billetera de Hardware

# keystone.drawer.banner.title
source: Keystone Hardware Wallet
es: Billetera de Hardware Keystone

# keystone.drawer.banner.desc
source: Get 5%% off airgapped hardware wallet. Promo code "Zashi".
es: Obtén un 5%% de descuento en una billetera de hardware aislada. Código promocional: 'Zashi'.

# keystone.addHWWallet.title
source: Confirm Account to Access
es: Confirma tu Cuenta para Acceder

# keystone.addHWWallet.desc
source: Select the wallet you'd like to connect to proceed. Once connected, you’ll be able to wirelessly sign transactions with your hardware wallet.
es: Selecciona la billetera que deseas conectar para continuar. Una vez conectada, podrás firmar transacciones de manera inalámbrica con tu billetera de hardware.

# keystone.addHWWallet.connect
source: Connect
es: Conectar

# keystone.addHWWallet.forgetDevice
source: Forget this device
es: Olvidar este dispositivo

# keystone.addHWWallet.scan
source: Scan your device’s QR code to connect.
es: Escanea el código QR de tu dispositivo para conectarte.

# keystone.addHWWallet.tutorial
source: View Keystone tutorial
es: Ver tutorial de Keystone

# keystone.addHWWallet.howTo
source: Instructions:
es: Instrucciones:

# keystone.addHWWallet.step1
source: Unlock your Keystone
es: Desbloquea tu Keystone

# keystone.addHWWallet.step2
source: Tap the menu icon
es: Toca el ícono del menú

# keystone.addHWWallet.step3
source: Tap on Connect Software Wallet
es: Selecciona 'Conectar Billetera de Software'

# keystone.addHWWallet.step4
source: Select Zashi app and scan QR code
es: Selecciona la app Zashi y escanea el código QR

# keystone.addHWWallet.readyToScan
source: Ready to Scan
es: Listo para Escanear

# keystone.confirm
source: Confirm with Keystone
es: Confirma con Keystone

# keystone.signWith.title
source: Scan with your Keystone wallet
es: Escanea con tu billetera Keystone

# keystone.signWith.desc
source: After you have signed with Keystone, tap on the Get Signature button below.
es: Después de firmar con Keystone, toca el botón 'Obtener Firma' abajo.

# keystone.signWith.getSignature
source: Get Signature
es: Obtener Firma

# keystone.signWith.reject
source: Reject
es: Rechazar

# keystone.signWith.signTransaction
source: Sign Transaction
es: Firmar Transacción

# keystone.scanInfo
source: Scan Keystone wallet QR code
es: Escanea el código QR de tu billetera Keystone

# keystone.scanInfoTransaction
source: Scan Keystone QR code to sign the transaction
es: Escanea el código QR de Keystone para firmar la transacción

# keystone.settings
source: Switch from Keystone to Zashi to use Integrations.
es: Cambia de Keystone a Zashi para usar Integraciones.

# accounts.sendingFrom
source: Sending from
es: Enviando desde

# accounts.addressBook.your
source: Your Wallets
es: Tus Billeteras

# accounts.addressBook.contacts
source: Address Book Contacts
es: Contactos del Libro de Direcciones

# accounts.zashi.shieldedAddress
source: Zcash Shielded Address
es: Dirección Protegida de Zcash

# accounts.zashi.transparentAddress
source: Zcash Transparent Address
es: Dirección Transparente de Zcash

# accounts.keystone.shieldedAddress
source: Zcash Shielded Address
es: Dirección Protegida de Zcash

# accounts.keystone.transparentAddress
source: Zcash Transparent Address
es: Dirección Transparente de Zcash

# keystoneTransactionReject.title
source: Are you sure?
es: ¿Estás seguro?

# keystoneTransactionReject.msg
source: Rejecting the signature will cancel the transaction, and you’ll need to start over if you want to proceed.
es: Rechazar la firma cancelará la transacción y tendrás que empezar de nuevo si deseas continuar.

# keystoneTransactionReject.goBack
source: Go back
es: Volver

# keystoneTransactionReject.rejectSig
source: Reject Signature
es: Rechazar firma

# taxExport.fileName
source: %@_transaction_history_%@.csv
es: %@_historial_de_transacciones_%@.csv

# taxExport.download
source: Download
es: Descargar

# taxExport.title
source: Data Export
es: Exportación de Datos

# taxExport.taxFile
source: Export Tax File
es: Exportar Archivo de Impuestos

# taxExport.desc
source: Download your %@ transaction history from the previous calendar year in a .csv format.
es: Descarga el historial de transacciones de %@ del año calendario anterior en formato .csv.

# taxExport.shareDesc
source: %@ transaction history
es: %@ historial de transacciones

# transactionHistory.title
source: Transactions
es: Transacciones

# transactionHistory.seeAll
source: See all
es: Ver todo

# transactionHistory.nothingHere
source: There’s nothing here, yet.
es: Aún no hay nada aquí.

# transactionHistory.makeTransaction
source: Make the first move...
es: Haz el primer movimiento...

# transactionHistory.getSomeZec
source: Get some ZEC
es: Obtén algo de ZEC

# transactionHistory.saveAddress
source: Save address
es: Guardar dirección

# transactionHistory.sendAgain
source: Send again
es: Enviar de nuevo

# transactionHistory.details
source: Transaction Details
es: Detalles de la transacción

# transactionHistory.sentTo
source: Sent to
es: Enviado a

# transactionHistory.address
source: Address
es: Dirección

# transactionHistory.pending
source: Pending
es: Pendiente

# transactionHistory.completed
source: Completed
es: Completado

# transactionHistory.viewMore
source: View more
es: Ver más

# transactionHistory.viewLess
source: View less
es: Ver menos

# transactionHistory.noMessage
source: No Message
es: Sin mensaje

# annotation.edit
source: Edit a note
es: Editar nota

# annotation.addArticle
source: Add a note
es: Agregar una nota

# annotation.add
source: Add note
es: Agregar nota

# annotation.delete
source: Delete note
es: Eliminar nota

# annotation.save
source: Save note
es: Guardar nota

# annotation.placeholder
source: Write an optional note to describe this transaction...
es: Escribe una nota opcional para describir esta transacción...

# annotation.chars
source: %@/%@ characters
es: %@/%@ caracteres

# annotation.title
source: Note
es: Nota

# filter.title
source: Filter
es: Filtrar

# filter.sent
source: Sent
es: Enviado

# filter.received
source: Received
es: Recibido

# filter.memos
source: Memos
es: Memorandos

# filter.notes
source: Notes
es: Notas

# filter.bookmarked
source: Bookmarked
es: Marcado

# filter.contact
source: Contact
es: Contacto

# filter.reset
source: Reset
es: Restablecer

# filter.apply
source: Apply
es: Aplicar

# filter.today
source: Today
es: Hoy

# filter.yesterday
source: Yesterday
es: Ayer

# filter.previous7days
source: Previous 7 days
es: Últimos 7 días

# filter.previous30days
source: Previous 30 days
es: Últimos 30 días

# filter.search
source: Search
es: Buscar

# filter.noResults
source: No results
es: Sin resultados

# filter.weTried
source: We tried but couldn’t find anything.
es: Lo intentamos, pero no pudimos encontrar nada.

# filter.at
source: at
es: a las

# filter.daysAgo
source: %@ days ago
es: Hace %@ días

# settings.keystone
source: Connect Keystone Device
es: Conectar dispositivo Keystone

# settings.keystoneDesc
source: Pair your Keystone hardware wallet with Zashi to sign transactions.
es: Empareja tu billetera de hardware Keystone con Zashi para firmar transacciones.

source: More Options
es: Más Opciones

# homeScreen.scan
source: Scan
es: Escanear

# homeScreen.more
source: More
es: Más

# homeScreen.buy
source: Buy
es: Comprar

# homeScreen.moreWarning
source: Information shared with Zashi integrations is subject to their privacy policies.
es: La información compartida con las integraciones de Zashi está sujeta a sus políticas de privacidad.

# restoreWallet.title
source: Secret Recovery Phrase
es: Frase de Recuperación Secreta

# restoreWallet.info
source: Please type in your 24-word secret recovery phrase in the correct order.
es: Por favor, ingresa tu frase secreta de recuperación de 24 palabras en el orden correcto.

# restoreWallet.help.title
source: Need to know more?
es: ¿Necesitas saber más?

# restoreWallet.help.phrase
source: ^[The Secret Recovery Phrase](style: 'boldPrimary') is a unique set of 24 words, appearing in a precise order. It can be used to gain full control of your funds from any device via any Zcash wallet app. Think of it as the master key to your wallet. It is stored in Zashi’s Advanced Settings.
es: ^[La Frase de Recuperación Secreta](style: 'boldPrimary') es un conjunto único de 24 palabras, que aparecen en un orden preciso. Se puede usar para obtener control total de tus fondos desde cualquier dispositivo a través de cualquier aplicación de billetera Zcash. Piensa en ella como la llave maestra de tu billetera. Se guarda en la Configuración Avanzada de Zashi.

# restoreWallet.help.birthday
source: ^[The Wallet Birthday Height](style: 'boldPrimary') is the block height (block # in the blockchain) at which your wallet was created. If you ever lose access to your Zashi app and need to recover your funds, providing the block height along with your recovery phrase can significantly speed up the process.
es: ^[La Altura de Cumpleaños de la Billetera](style: 'boldPrimary') es la altura del bloque (número de bloque en la blockchain) en el que tu billetera fue creada. Si alguna vez pierdes acceso a tu aplicación Zashi y necesitas recuperar tus fondos, proporcionar la altura del bloque junto con tu frase de recuperación puede acelerar significativamente el proceso.

# restoreWallet.birthday.placeholder
source: Enter number
es: Ingresa el número

# restoreWallet.birthday.title
source: Block Height
es: Altura de Bloque

# restoreWallet.birthday.info
source: Entering your Wallet Birthday Height helps speed up the restore process.
es: Ingresar la Altura de Cumpleaños de tu Billetera ayuda a acelerar el proceso de restauración.

# restoreWallet.birthday.fieldInfo
source: Wallet Birthday Height is the point in time when your wallet was created.
es: La Altura de Cumpleaños de la Billetera es el momento en que se creó tu billetera.

# restoreWallet.birthday.estimate
source: Estimate my block height
es: Estimar mi altura de bloque

# restoreWallet.birthday.estimateDate.title
source: First Wallet Transaction
es: Primera Transacción de la Billetera

# restoreWallet.birthday.estimateDate.info
source: Entering the block height at which your wallet was created reduces the number of blocks that need to be scanned to recover your wallet.
es: Ingresar la altura de bloque en la que se creó tu billetera reduce la cantidad de bloques que necesitan ser escaneados para recuperar tu billetera.
