Repository: Electric-Coin-Company/zashi-ios
Catalog: modules/Sources/Generated/Resources/*.lproj/Localizable.strings
Languages: es

# restoreWallet.birthday.estimateDate.warning
source: If you’re not sure, choose an earlier date.
es: Si no estás seguro, elige una fecha anterior.

# restoreWallet.birthday.estimated.title
source: Estimated Block Height
es: Altura de Bloque Estimada

# restoreWallet.birthday.estimated.info
source: Zashi will scan and recover all transactions made after the following block number.
es: Zashi escaneará y recuperará todas las transacciones realizadas después del siguiente número de bloque.

# restoreInfo.checkbox
source: Keep screen on while restoring
es: Mantener la pantalla encendida mientras se restaura

# restoreWallet.dateTip
source: If you’re not sure, choose an earlier date.
es: Si no estás seguro, elige una fecha anterior.

# smartBanner.help.diconnected.title
source: Wallet Disconnected
es: Billetera Desconectada

# smartBanner.help.diconnected.info
source: You appear to be offline. Please restore your internet connection to use Zashi wallet.
es: Parece que estás offline. Por favor, restaura tu conexión a internet para usar la billetera Zashi.

# smartBanner.help.syncError.title
source: Syncing Error
es: Error de Sincronización

# smartBanner.help.restore.title
source: Wallet Restore in Progress
es: Restauración de Billetera en Progreso

# smartBanner.help.restore.info
source: Zashi is scanning the blockchain to retrieve your transactions. Older wallets can take hours to restore. Follow these steps to prevent interruption:
es: Zashi está escaneando la blockchain para recuperar tus transacciones. Las billeteras más antiguas pueden tardar horas en restaurarse. Sigue estos pasos para evitar interrupciones:

# smartBanner.help.restore.point1
source: Keep the Zashi app open on an active phone screen.
es: Mantén la aplicación Zashi abierta en una pantalla activa del teléfono.

# smartBanner.help.restore.point2
source: To prevent your phone screen from going dark, turn off power-saving mode and keep your phone plugged in.
es: Para evitar que la pantalla de tu teléfono se apague, desactiva el modo de ahorro de energía y mantén tu teléfono conectado.

# smartBanner.help.restore.warning
source: Funds cannot be spent until your wallet is restored.
es: Los fondos no pueden ser gastados hasta que tu billetera esté restaurada.

# smartBanner.help.sync.title
source: Wallet Sync in Progress
es: Sincronización de Billetera en Progreso

# smartBanner.help.sync.info
source: Zashi is scanning the blockchain for your latest transactions to make sure your balances are displayed correctly. Keep the Zashi app open on an active phone screen to avoid interruptions.
es: Zashi está escaneando la blockchain para tus últimas transacciones para asegurarse de que tus balances se muestren correctamente. Mantén la aplicación Zashi abierta en una pantalla activa del teléfono para evitar interrupciones.

# smartBanner.help.updatingBalance.title
source: Updating Balance
es: Actualizando Balance

# smartBanner.help.updatingBalance.info
source: Your last transaction is getting mined and confirmed.
es: Tu última transacción está siendo minada y confirmada.

# smartBanner.help.backup.title
source: Backup Required
es: Respaldo Requerido

# smartBanner.help.backup.info1
source: Prevent potential loss of funds by securely backing up your wallet.
es: Evita la pérdida potencial de fondos respaldando tu billetera de forma segura.

# smartBanner.help.backup.info2
source: Back up access to your funds by backing up:
es: Respalda el acceso a tus fondos realizando un respaldo de:

# smartBanner.help.backup.point1
source: Secret Recovery Phrase (a unique set of 24 words in a precise order)
es: Frase de Recuperación Secreta (un conjunto único de 24 palabras en un orden preciso)

# smartBanner.help.backup.point2
source: Wallet Birthday Height (block height at which your wallet was created)
es: Altura de Cumpleaños de la Billetera (altura de bloque en la que se creó tu billetera)

# smartBanner.help.backup.info3
source: In case you lose access to the app or to your device, knowing the Secret Recovery Phrase is the only way to recover your funds. We cannot see it and cannot help you recover it.
es: En caso de que pierdas acceso a la aplicación o a tu dispositivo, conocer la Frase de Recuperación Secreta es la única forma de recuperar tus fondos. No podemos verla ni podemos ayudarte a recuperarla.

# smartBanner.help.backup.info4
source: Anyone with access to your Secret Recovery Phrase will have full control of your wallet, so keep it secure and never show it to anyone.
es: Cualquiera que tenga acceso a tu Frase de Recuperación Secreta tendrá control total de tu billetera, así que mantenla segura y nunca la muestres a nadie.

# smartBanner.help.backup.acknowledge
source: I read and understand the risks of not backing up my wallet.
es: He leído y entiendo los riesgos de no respaldar mi billetera.

# smartBanner.help.shield.title
source: Always Shield Transparent Funds
es: Protege Siempre los Fondos Transparentes

# smartBanner.help.shield.info1
source: To protect user privacy, Zashi doesn't support spending transparent ZEC. Tap the "Shield" button below to make your transparent funds spendable and your total Zashi balance private.
es: Para proteger la privacidad del usuario, Zashi no admite el gasto de ZEC transparente. Toca el botón "Proteger" abajo para hacer que tus fondos transparentes sean gastables y tu saldo total en Zashi sea privado.

# smartBanner.help.shield.info2
source: This will create a shielding in-wallet transaction, consolidating your transparent and shielded funds. (Typical fee: %@)
es: Esto creará una transacción de protección en la billetera, consolidando tus fondos transparentes y protegidos. (Tarifa típica: %@)

# smartBanner.help.shield.transparent
source: Transparent
es: Transparente

# smartBanner.help.shield.notNow
source: Not now
es: Ahora no

# smartBanner.help.shield.doNotShowAgain
source: Do not show this message again
es: No mostrar este mensaje de nuevo

# smartBanner.help.remindMePhase1
source: Remind me in 2 days
es: Recuérdame en 2 días

# smartBanner.help.remindMePhase2
source: Remind me in 2 weeks
es: Recuérdame en 2 semanas

# smartBanner.help.remindMePhase3
source: Remind me next month
es: Recuérdame el próximo mes

# smartBanner.content.disconnected.title
source: Wallet Disconnected
es: Billetera Desconectada

# smartBanner.content.disconnected.info
source: Check your connection and reload Zashi
es: Verifica tu conexión y recarga Zashi

# smartBanner.content.syncingError.title
source: Error encountered while syncing
es: Error al sincronizar

# smartBanner.content.syncingError.info
source: Attempting to resolve
es: Intentando resolver

# smartBanner.content.restore.title
source: Restoring Wallet • %@ Complete
es: Restaurando Billetera • %@ Completo

# smartBanner.content.restore.info
source: Keep Zashi open on active phone screen
es: Mantén Zashi abierta en una pantalla activa del teléfono

# smartBanner.content.restore.infoSpendable
source: Your funds are ready to be used now
es: Tus fondos están listos para ser utilizados ahora

# smartBanner.content.sync.title
source: Syncing • %@ Complete
es: Sincronizando • %@ Completo

# smartBanner.content.sync.info
source: Your wallet is updating
es: Tu billetera se está actualizando

# smartBanner.content.updatingBalance.title
source: Updating Balance...
es: Actualizando Balance...

# smartBanner.content.updatingBalance.info
source: Waiting for last transaction to process
es: Esperando a que la última transacción se procese

# smartBanner.content.backup.title
source: Wallet Backup Required
es: Respaldo de Billetera Requerido

# smartBanner.content.backup.info
source: Prevent potential loss of funds
es: Evita la pérdida potencial de fondos

# smartBanner.content.backup.button
source: Start
es: Iniciar

# smartBanner.content.shield.title
source: Transparent Balance Detected
es: Saldo Transparente Detectado

# smartBanner.content.shield.titleShorter
source: Transparent Balance
es: Saldo Transparente

# smartBanner.content.shield.button
source: Shield
es: Proteger

# smartBanner.content.tor.title
source: Beta: Enable Tor Protection
es: Beta: Activar protección Tor

# smartBanner.content.tor.info
source: Protect your IP address
es: Protege tu dirección IP

# smartBanner.content.tor.button
source: Review
es: Revisar

# smartBanner.content.currencyConversion.title
source: Currency Conversion
es: Conversión de Moneda

# smartBanner.content.currencyConversion.info
source: Enable to display USD values
es: Activa para mostrar valores en USD

# smartBanner.content.currencyConversion.button
source: Start
es: Iniciar

# smartBanner.content.autoShielding.title
source: Auto-Shielding
es: Auto-Protección

# smartBanner.content.autoShielding.info
source: Enable automatic shielding
es: Activa la protección automática

# smartBanner.content.autoShielding.button
source: Start
es: Iniciar

# currencyConversion.skipBtn
source: Skip
es: Omitir

# balance.availableTitle
source: Spendable:
es: Gastable:

# balances.pending
source: Pending
es: Pendiente

# balances.dismiss
source: Dismiss
es: Descartar

# balances.spendableBalance.title
source: Spendable Balance
es: Balance Gastable

# balances.spendableBalance
source: Shielded (Spendable)
es: Protegido (Gastable)

# balances.infoSyncing
source: Zashi is scanning the blockchain to make sure your balances are displayed correctly.
es: Zashi está escaneando la blockchain para asegurarse de que tus balances se muestren correctamente.

# balances.infoShielding
source: Shield your transparent ZEC to make it spendable and private. Doing so will create a shielding in-wallet transaction, consolidating your transparent and shielded funds. (Typical fee: %@)
es: Protege tus ZEC transparentes para hacerlos gastables y privados. Esto creará una transacción de protección en la billetera, consolidando tus fondos transparentes y protegidos. (Tarifa típica: %@)

# balances.everythingDone
source: All your funds are shielded and spendable.
es: Todos tus fondos están protegidos y son gastables.

# shieldFunds.error.title
source: Shielding Error
es: Error de Protección

# shieldFunds.error.failure.message
source: An error happened during the last shielding transaction. You can try again later or report this issue if the problem persists. %@
es: Ocurrió un error durante la última transacción de protección. Puedes intentarlo nuevamente más tarde o reportar este problema si persiste. %@

# shieldFunds.error.gprc.message
source: An error happened during the last shielding transaction. We will try to resubmit the transaction later. If it fails, you may need to repeat the shielding attempt at a later time.
es: Ocurrió un error durante la última transacción de protección. Intentaremos reenviar la transacción más tarde. Si falla, es posible que debas repetir el intento de protección más tarde.

# transactionHistory.status
source: Status
es: Estado

# recoveryPhraseDisplay.screenTitle
source: Wallet Backup
es: Respaldo de Billetera

# recoveryPhraseDisplay.title
source: Secret Recovery Phrase
es: Frase de Recuperación Secreta

# recoveryPhraseDisplay.description
source: These words are the only way to recover your funds! Make sure to save them in the correct order.
es: ¡Estas palabras son la única manera de recuperar tus fondos! Asegúrate de guardarlas en el orden correcto.

# recoveryPhraseDisplay.button.wroteItDown
source: I've saved it
es: Lo he guardado

# recoveryPhraseDisplay.button.remindMeLater
source: Remind me later
es: Recuérdame más tarde

# recoveryPhraseDisplay.noWords
source: The keys are missing. No backup phrase is stored in the keychain.
es: Faltan las claves. No hay ninguna frase de respaldo almacenada en el llavero.

# recoveryPhraseDisplay.birthdayTitle
source: Wallet Birthday Height
es: Altura de Cumpleaños de la Billetera

# recoveryPhraseDisplay.reveal
source: Reveal security details
es: Mostrar detalles de seguridad

# recoveryPhraseDisplay.hide
source: Hide security details
es: Ocultar detalles de seguridad

# recoveryPhraseDisplay.alert.failed.title
source: Failed to load stored wallet
es: No se pudo cargar la billetera almacenada

# recoveryPhraseDisplay.alert.failed.message
source: Attempt to load the stored wallet from the keychain failed. Error: %@
es: El intento de cargar la billetera almacenada desde el llavero falló. Error: %@

# recoveryPhraseDisplay.warningTitle
source: Your Secret Recovery Phrase
es: Tu Frase de Recuperación Secreta

# recoveryPhraseDisplay.warningInfo
source: Your secret recovery phrase is a unique set of 24 words, appearing in a precise order. It protects access to your funds.
es: Tu frase de recuperación secreta es un conjunto único de 24 palabras, que aparecen en un orden preciso. Protege el acceso a tus fondos.

# recoveryPhraseDisplay.warningControl.title
source: Control your wallet
es: Controla tu billetera

# recoveryPhraseDisplay.warningControl.info
source: Use it to access your funds from other devices and Zcash wallets.
es: Úsala para acceder a tus fondos desde otros dispositivos y billeteras Zcash.

# recoveryPhraseDisplay.warningKeep.title
source: Keep it private
es: Manténla privada

# recoveryPhraseDisplay.warningKeep.info
source: Don't share it with anyone! It can be used to gain full control of your funds.
es: ¡No la compartas con nadie! Puede usarse para obtener control total de tus fondos.

# recoveryPhraseDisplay.warningStore.title
source: Store it securely
es: Guárdala de manera segura

# recoveryPhraseDisplay.warningStore.info
source: We don’t have access to it and will never ask for it. If you lose it, it cannot be recovered.
es: No tenemos acceso a ella y nunca te pediremos que la compartas. Si la pierdes, no puede ser recuperada.

# recoveryPhraseDisplay.warningHeight.title
source: Wallet birthday height
es: Altura de cumpleaños de la billetera

# recoveryPhraseDisplay.warningHeight.info
source: The block height at which your wallet was created can significantly speed up the wallet recovery process.
es: La altura del bloque en el que se creó tu billetera puede acelerar significativamente el proceso de recuperación de la billetera.

# recoveryPhraseDisplay.proceedWarning
source: Keep this phrase securely hidden. Don’t take screenshots of it or store it on your phone!
es: Mantén esta frase de manera segura oculta. ¡No tomes capturas de pantalla ni la guardes en tu teléfono!

# torSetup.title
source: Beta: Tor Protection
es: Beta: Protección Tor

# torSetup.learn.desc
source: This beta feature provides additional protections for your IP address. If Tor is permitted in your region, we recommend enabling it. You can manage this in Advanced Settings.
es: Esta función beta brinda protección adicional a tu dirección IP. Si el uso de Tor está permitido en tu región, te recomendamos activarla. Puedes gestionarlo en Configuración avanzada.

# torSetup.settings.desc1
source: Tor provides additional protections for your IP address. This feature uses Tor network to fetch exchange rates, send transactions, retrieve transaction data, and connect to third party APIs (e.g. NEAR coming soon).
es: Esta función beta brinda protección adicional para tu dirección IP. Utiliza Tor para obtener tasas de cambio, enviar transacciones, recuperar datos de transacciones y conectarse a APIs de terceros (p. ej., NEAR, muy pronto!).

# torSetup.settings.desc2
source: As a beta feature, it may affect performance. If Tor is permitted in your region, we recommend enabling it.
es: Al ser una función beta, podría afectar el rendimiento. Si el uso de Tor está permitido en tu región, te recomendamos habilitarlo.

# torSetup.option1.title
source: Currency Conversion
es: Conversión de moneda

# torSetup.option1.desc
source: Fetch exchange rates from third-party servers without revealing your IP address. (Only available with Tor enabled.)
es: Obtén tasas de cambio desde servidores de terceros sin revelar tu dirección IP. (Disponible solo con Tor activado.)

# torSetup.option2.title
source: Transactions
es: Transacciones

# torSetup.option2.desc
source: Send and retrieve transaction data over Tor for added privacy.
es: Envía y recupera datos de transacciones a través de Tor para mayor privacidad.

# torSetup.option3.title
source: Integrations
es: Integraciones

# torSetup.option3.desc
source: Access third-party APIs (e.g. NEAR) over Tor for added privacy.
es: Accede a APIs de terceros (por ejemplo, NEAR) a través de Tor para mayor privacidad.

# settings.private
source: Beta: Tor Protection
es: Beta: Protección Tor

# torSetup.enableDesc
source: Connect over Tor.
es: Conectarse mediante Tor.

# torSetup.disableDesc
source: Don’t connect over Tor.
es: No conectarse mediante Tor.

# torSetup.learn.btnIn
source: Opt in
es: Activar

# torSetup.learn.btnOut
source: Opt out
es: Desactivar

# torSetup.ccSheet.title
source: Tor Required for Currency Conversion
es: Se requiere Tor para la conversión de moneda

# torSetup.ccSheet.desc1
source: Tor Protection is a beta feature that provides additional protections for your IP address. USD exchange rates are only available when it is enabled.
es: La protección Tor es una función beta que brinda protección adicional a tu dirección IP. Las tasas de cambio en USD solo están disponibles cuando está activada.

# torSetup.ccSheet.desc2
source: If Tor is permitted in your region, we recommend enabling it. You can manage it in Advanced Settings.
es: Si el uso de Tor está permitido en tu región, te recomendamos activarla. Puedes gestionarlo en Configuración avanzada.

# torSetup.ccSheet.later
source: Do it later
es: Hacerlo después

# torSetup.ccSheet.enable
source: Enable
es: Activar

# torSetup.alert.title
source: Disable Tor?
es: ¿Desactivar Tor?

# torSetup.alert.msg
source: Tor connection issues detected. To improve performance, try disabling Tor. This will stop exchange rate updates. You can re-enable it later in Advanced Settings.
es: Se detectaron problemas de conexión con Tor. Para mejorar el rendimiento, intenta desactivarlo. Esto detendrá la actualización de tasas de cambio. Puedes volver a activarlo más adelante en Configuración avanzada.

# torSetup.alert.disable
source: Disable
es: Desactivar

# torSetup.alert.dontDisable
source: Don’t disable
es: No desactivar

# receive.help.shielded.title
source: Zcash Shielded Address (Rotating)
es: Dirección protegida de Zcash (rotativa)

# receive.help.shielded.desc1
source: Use this address to receive and store your ZEC privately. Transparent and shielded ZEC sent to this address will be received and stored as shielded ZEC.
es: Usa esta dirección para recibir y almacenar tus ZEC de forma privada. Los ZEC transparentes y protegidos enviados a esta dirección se recibirán y almacenarán como ZEC protegidos.

# receive.help.shielded.desc2
source: A new Zcash Shielded Address is generated each time you open the Receive screen.
es: Se genera una nueva dirección protegida de Zcash cada vez que abres la pantalla de "Recibir".

# receive.help.shielded.desc3
source: All transactions sent to your different rotating Shielded Addresses will remain part of one wallet balance under the same seed phrase.
es: Todas las transacciones enviadas a tus diferentes direcciones protegidas rotativas formarán parte de un mismo saldo de billetera vinculado a tu frase semilla.

# receive.help.shielded.desc4
source: While we recommend using a new address every time, each unique address can be reused.
es: Aunque recomendamos usar una nueva dirección cada vez, cada dirección única se puede reutilizar.

# receive.help.transparent.title
source: Zcash Transparent Address (Static)
es: Dirección transparente de Zcash (estática)

# receive.help.transparent.desc1
source: This addresses type works just like Bitcoin addresses and offers NO PRIVACY. The details of transactions sent to this address will be public and visible on the blockchain.
es: Este tipo de dirección funciona como una dirección de Bitcoin y NO OFRECE PRIVACIDAD. Los detalles de las transacciones enviadas a esta dirección serán públicos y visibles en la blockchain.

# receive.help.transparent.desc2
source: We don't recommend using this address type unless the wallet or exchange from which ZEC is being sent doesn’t support sending funds to shielded Zcash addresses.
es: No recomendamos usar este tipo de dirección a menos que la billetera o casa de cambio desde donde se envían los ZEC no admita direcciones protegidas de Zcash.

# receive.help.transparent.desc3
source: To protect your privacy, Zashi will guide you to shield any transparent ZEC you receive with just one click.
es: Para proteger tu privacidad, Zashi te guiará para proteger cualquier ZEC transparente que recibas con un solo clic.

# receive.help.transparent.desc4
source: You won't be able to spend your transparent ZEC until you shield it.
es: No podrás gastar tus ZEC transparentes hasta que los protejas.

# receive.ua.rotateInfo
source: Rotates every time you use it
es: Rota cada vez que la usas

# sendSelect.zashi.send
source: Pay in ZEC
es: Pagar en ZEC

# sendSelect.zashi.send.desc
source: Pay anyone by sending them ZEC.
es: Paga a cualquiera enviándole ZEC.

# swapAndPay.selectToken
source: Select asset
es: Seleccionar activo

# swapAndPay.enterAddress
source: Enter address...
es: Ingresar dirección...

# swapAndPay.select
source: Select...
es: Seleccionar...

# swapAndPay.getQuote
source: Get a quote
es: Obtener cotización

# swapAndPay.recipientGets
source: Recipient gets
es: El destinatario recibe

# swapAndPay.slippage
source: Slippage
es: Deslizamiento

# swapAndPay.youPay
source: You pay
es: Tú pagas

# swapAndPay.slippageDesc
source: A slippage setting determines the maximum allowable difference between the expected and actual price of a swap.
es: Esta configuración determina la diferencia máxima permitida entre el precio esperado de un intercambio y el precio real que pagas, lo cual está fuera del control de Zashi.

# swapAndPay.quoteUnavailable
source: Quote Unavailable
es: Cotización no disponible

# swapAndPay.cancelPayment
source: Cancel payment
es: Cancelar pago

# swapAndPay.editPayment
source: Edit payment
es: Editar pago

# swapAndPay.payNow
source: Pay now
es: Pagar Ahora

# swapAndPay.payFrom
source: Pay from
es: Pagar desde

# swapAndPay.payTo
source: Pay to
es: Pagar a

# swapAndPay.fee
source: ZEC transaction fee
es: Comisión de transacción ZEC

# swapAndPay.maxSlippage
source: Max slippage %@%
es: Máx. deslizamiento %@%

# swapAndPay.totalAmount
source: Total Amount
es: Monto total

# swapAndPay.search
source: Search by name or ticker...
es: Buscar por nombre o ticker...

# swapAndPay.slippageSet1
source: You will pay up to
es: Podrías recibir hasta

# swapAndPay.slippageSet3
source: for the swap.
es: menos de lo cotizado.

# swapAndPay.slippageWarn
source: Any unused portion of the slippage fee will be refunded if the swap executes with lower slippage than expected.
es: Cualquier parte no utilizada de la comisión de deslizamiento será reembolsada si el intercambio se ejecuta con menos deslizamiento del esperado.

# swapAndPay.customSlippage
source: Enter custom slippage
es: Ingresar deslizamiento personalizado

# balances.infoPending
source: Pending transactions are getting mined and confirmed.
es: Pendiente de recibir el cambio de una transacción anterior.

# send.resubmission
source: Connection Error
es: Problema de Conexión

# about.info
source: Send and receive ZEC on Zashi! Zashi is a minimal-design, self-custody, ZEC-only shielded wallet that keeps your transaction history and wallet balance private.
es: Zashi es una wallet móvil impulsada por Zcash, creada para pagos privados imparables. Está optimizada para almacenar y usar en el mundo real $ZEC protegido: la criptomoneda verdaderamente privada.
