Repository: Electric-Coin-Company/zashi-ios
Catalog: modules/Sources/Generated/Resources/*.lproj/Localizable.strings
Languages: es

# plainOnboarding.title
source: A Zcash (ZEC) wallet built for private payments
es: Una billetera Zcash (ZEC) diseñada para pagos privados

# plainOnboarding.button.createNewWallet
source: Create new wallet
es: Crear nueva billetera

# plainOnboarding.button.restoreWallet
source: Restore existing wallet
es: Restaurar billetera existente

# errorPage.action.contactSupport
source: Contact Support
es: Contactar Soporte

# proposalPartial.title
source: Send Failed
es: Envío Fallido

# proposalPartial.message1
source: Send to this recipient required multiple transactions but only some of them succeeded and the rest failed. Your funds are safe but need to be recovered with assistance from our side.
es: Enviar a este destinatario requirió múltiples transacciones, pero solo algunas de ellas se completaron con éxito. Tus fondos están seguros, pero deben recuperarse con la ayuda del soporte del equipo de Zashi.

# proposalPartial.message2
source: Please use the button below to contact us. it automatically prepares all the data we need in order to help you restore your funds.
es: Por favor, usa el botón de abajo para contactarnos y recuperar tus fondos. Tu mensaje estará pre-rellenado con todos los datos necesarios para resolver este problema.

# proposalPartial.transactionIds
source: Transaction Ids
es: IDs de transacción

# proposalPartial.copyIds
source: Copy transaction IDs
es: Copiar IDs de transacción

# proposalPartial.mailSubject
source: TEX Transaction Error
es: Error de transacción TEX

# proposalPartial.mailPart1
source: Hi Zashi Team,
es: Hola, equipo de Zashi,

# proposalPartial.mailPart2
source: While sending a transaction to a TEX address, I encountered an error state. I'm reaching out to get guidance on how to recover my funds.
es: Al enviar una transacción a una dirección TEX, encontré un estado de error. Me pongo en contacto para recibir orientación sobre cómo recuperar mis fondos.

# proposalPartial.mailPart3
source: Thank you.
es: Gracias.

# proposalPartial.transactionStatuses
source: Transaction statuses:
es: Estados de la transacción:

# osStatusError.title
source: It’s not you, it’s us.
es: No eres tú, somos nosotros.

# osStatusError.message
source: Your funds are safe but something happened while we were trying to retrieve the Keychain data. Close the Zashi app, and give it a fresh launch, we will try again.
es: Tus fondos están seguros, pero algo ocurrió mientras intentábamos recuperar los datos del llavero. Cierra la aplicación de Zashi y ábrela de nuevo; lo intentaremos otra vez.

# osStatusError.error
source: Error code: %@
es: Código de error: %@

# importWallet.description
source: Enter secret recovery phrase
es: Ingresa la frase secreta de recuperación

# importWallet.message
source: Enter your 24-word seed phrase to restore the associated wallet.
es: Ingresa tu frase semilla de 24 palabras para restaurar la billetera asociada.

# importWallet.button.restoreWallet
source: Restore
es: Restaurar

# importWallet.birthday.title
source: Wallet birthday height
es: Altura de cumpleaños de la billetera

# importWallet.seed.valid
source: VALID SEED PHRASE
es: FRASE SEMILLA VÁLIDA

# importWallet.alert.success.message
source: Your wallet has been successfully restored! During the initial sync, your funds cannot be spent or sent. Depending on the age of your wallet, it may take a few hours to fully sync.
es: ¡Tu billetera ha sido restaurada con éxito! Durante la sincronización inicial, tus fondos no se podrán gastar ni enviar. Dependiendo de la antigüedad de tu billetera, puede tomar algunas horas sincronizar completamente.

# importWallet.alert.failed.title
source: Failed to restore wallet
es: No se pudo restaurar la billetera

# importWallet.optionalBirthday
source: (optional)
es: (opcional)

# importWallet.enterPlaceholder
source: privacy dignity freedom ...
es: privacidad dignidad libertad ...

# restoreInfo.title
source: Keep Zashi open!
es: ¡Mantén Zashi abierto!

# restoreInfo.subTitle
source: Your wallet is being restored.
es: Tu billetera ha sido restaurada con éxito y ahora se está sincronizando

# restoreInfo.tips
source: Zashi is scanning the blockchain to retrieve your transactions. Older wallets can take hours to restore. Follow these steps to prevent interruption:
es: Consejos de sincronización:

# restoreInfo.tip1
source: Keep the Zashi app open on an active phone screen.
es: Zashi debe permanecer abierto para continuar sincronizando.

# restoreInfo.tip2
source: To prevent your phone screen from going dark, turn off power-saving mode and keep your phone plugged in.
es: Para evitar interrupciones, conecta tu teléfono encendido a una fuente de energía.

# restoreInfo.note
source: Note:
es: Nota:

# restoreInfo.noteInfo
source: Your funds cannot be spent with Zashi until your wallet is fully restored.
es: Durante la sincronización inicial, tus fondos no se pueden enviar ni gastar. Dependiendo de la antigüedad de tu billetera, puede tomar algunas horas sincronizar completamente.

# restoreInfo.gotIt
source: Got it!
es: ¡Entendido!

# tabs.account
source: Account
es: Cuenta

# tabs.send
source: Send
es: Enviar

# tabs.receive
source: Receive
es: Recibir

# tabs.receiveZec
source: Receive ZEC
es: Recibir ZEC

# tabs.balances
source: Balances
es: Saldos

# home.migratingDatabases
source: Upgrading databases…
es: Actualizando bases de datos…

# addressDetails.shareTitle
source: My Zashi ZEC Address
es: Mi Dirección ZEC de Zashi

# addressDetails.shareDesc
source: Hi, scan this QR code to send me a ZEC payment!
es: Hola, ¡escanea este código QR para enviarme un pago en ZEC!

# addressDetails.shareQR
source: Share QR Code
es: Compartir Código QR

# addressDetails.copyAddress
source: Copy Address
es: Copiar Dirección

# requestZec.title
source: Payment Request
es: Solicitud de Pago

# requestZec.whatFor
source: What’s this for?
es: ¿Para qué es esto?

# requestZec.summary.shareQR
source: Share QR Code
es: Compartir Código QR

# requestZec.summary.shareTitle
source: Request ZEC
es: Solicitar ZEC

# requestZec.summary.shareDesc
source: Hi, I have generated a ZEC payment request for you using the Zashi app!
es: Hola, he generado una solicitud de pago en ZEC para ti utilizando la aplicación Zashi.

# requestZec.summary.shareMsg
source: (download link: https://apps.apple.com/app/zashi-zcash-wallet/id1672392439)
es: (enlace de descarga: https://apps.apple.com/app/zashi-zcash-wallet/id1672392439)

# receive.ua
source: Unified Address
es: Dirección Unificada

# receive.sa
source: Sapling Address
es: Dirección Sapling

# receive.ta
source: Transparent Address
es: Dirección Transparente

# receive.error.cantExtractUnifiedAddress
source: could not extract UA
es: no se pudo extraer la Dirección Unificada

# receive.error.cantExtractTransparentAddress
source: could not extract transparent receiver from UA
es: no se pudo extraer el receptor transparente de la Dirección Unificada

# receive.error.cantExtractSaplingAddress
source: could not extract sapling receiver from UA
es: no se pudo extraer el receptor Sapling de la Dirección Unificada

# receive.saplingAddress
source: Zcash Sapling Address
es: Dirección Sapling de Zcash

# receive.warning
source: For privacy, always use shielded address.
es: Para privacidad, utilice siempre una dirección protegida.

# receive.copy
source: Copy
es: Copiar

# receive.qrCode
source: QR Code
es: Código QR

# receive.request
source: Request
es: Solicitar

# serverSetup.title
source: Server
es: Servidor

# serverSetup.custom
source: custom server
es: Servidor personalizado

# serverSetup.default
source: Default
es: Predeterminado

# serverSetup.placeholder
source: <hostname>:<port>
es: <nombre del host>:<puerto>

# serverSetup.alert.failed.title
source: Invalid endpoint
es: Punto final no válido

# serverSetup.save
source: Save selection
es: Guardar selección

# serverSetup.active
source: Active
es: Activo

# serverSetup.performingTest
source: Performing Server Test
es: Realizando prueba de servidor

# serverSetup.couldTakeTime
source: This may take a moment...
es: Esto puede tardar un momento...

# serverSetup.fastestServers
source: Fastest servers
es: Servidores más rápidos

# serverSetup.otherServers
source: Other servers
es: Otros servidores

# serverSetup.allServers
source: Browse all servers
es: Explorar todos los servidores

# serverSetup.refresh
source: Refresh
es: Actualizar

# balances.transparentBalance
source: Transparent balance
es: Saldo transparente

# balances.shieldButtonTitle
source: Shield and consolidate funds
es: Proteger y consolidar fondos

# balances.shieldingInProgress
source: Shielding
es: Protegiendo

# balances.synced
source: Synced
es: Sincronizado

# balances.syncing
source: Syncing
es: Sincronizando

# balances.syncingError
source: Zashi encountered an error while syncing, attempting to resolve...
es: Zashi encontró un error al sincronizar, intentando resolver...

# balances.hintBox.message
source: Zashi uses the latest network upgrade and does not support sending transparent (unshielded) ZEC. Use the Shield and Consolidate button to shield your funds, which will add to your available balance and make your ZEC spendable.
es: Zashi utiliza la última actualización de la red y no admite el envío de ZEC transparentes (sin protección). Utiliza el botón Proteger y Consolidar para proteger tus fondos, lo que añadirá a tu saldo disponible y hará que tu ZEC sea gastable.

# balances.hintBox.dismiss
source: I got it!
es: ¡Entendido!

# balances.restoringWalletWarning
source: The restore process can take several hours on lower-powered devices, and even on powerful devices is likely to take more than an hour.
es: El proceso de restauración puede llevar varias horas en dispositivos de menor potencia, e incluso en dispositivos potentes es probable que lleve más de una hora.

# scan.invalidQR
source: This QR code doesn't hold a valid Zcash address.
es: Este código QR no contiene una dirección válida de Zcash.

# scan.invalidImage
source: This image doesn't hold a valid Zcash address.
es: Esta imagen no contiene una dirección válida de Zcash.

# scan.severalCodesFound
source: This image holds several valid Zcash addresses.
es: Esta imagen contiene varias direcciones válidas de Zcash.

# scan.cameraSettings
source: The camera is not authorized. Please go to the system settings of Zashi and turn it on.
es: La cámara no está autorizada. Por favor, ve a la configuración del sistema de Zashi y actívala.

# scan.openSettings
source: Open settings
es: Abrir configuración

# send.sending
source: Sending...
es: Enviando

# send.message
source: Message
es: Mensaje

# send.memoPlaceholder
source: Write encrypted message here...
es: Escribe un mensaje que será enviado cifrado...

# send.error.insufficientFunds
source: Insufficient funds
es: Fondos insuficientes

# send.error.invalidAmount
source: Invalid amount
es: Monto no válido

# send.error.invalidAddress
source: Invalid address
es: Dirección no válida

# send.info.memo
source: Transparent transactions can’t have memos
es: Las transacciones transparentes no pueden tener mensajes

# send.addressNotInBook
source: Add contact by tapping on Address Book icon.
es: Agrega un contacto tocando el ícono de la libreta de direcciones.

# send.amountSummary
source: Total Amount
es: Monto Total

# send.amount
source: Amount
es: Monto

# send.toSummary
source: Sending to
es: Enviando a

source: Send to
es: Enviar a

# send.feeSummary
source: Fee
es: Tarifa

# send.confirmationTitle
source: Confirmation
es: Confirmación

# send.goBack
source: Cancel
es: Cancelar

# send.review
source: Review
es: Revisar

# send.alert.failure.title
source: Failed to send funds
es: No se pudo enviar fondos

# send.addressPlaceholder
source: Zcash Address
es: Dirección de Zcash

# send.requestPayment.requestedBy
source: Requested By
es: Solicitado por

# send.requestPayment.for
source: For:
es: Para:

# send.requestPayment.title
source: Payment Request
es: Solicitud de Pago

# send.sendingInfo
source: Your coins are being sent to
es: Tus monedas están siendo enviados a

# send.viewTransaction
source: View Transaction
es: Ver Transacción

# send.success
source: Sent!
es: ¡Enviado!

# send.successInfo
source: Your coins were successfully sent to
es: Tus monedas fueron enviados exitosamente a

# send.failure
source: Unable to send
es: No se pudo enviar

# send.failureInfo
source: There was an error attempting to send coins. Try it again, please.
es: Hubo un error al intentar enviar monedas. Por favor, inténtalo de nuevo.

# send.resubmissionInfo
source: Zashi encountered connection issues when submitting the transaction. It will retry in the next few minutes.
es: Zashi encontró problemas de conexión al enviar la transacción. Intentará de nuevo en los próximos minutos.

# send.report
source: Report
es: Reportar

# send.shielding
source: Shielding
es: Protegiendo

# send.shieldingInfo
source: Your coins are getting shielded
es: Tus monedas están siendo protegidos

# send.successShielding
source: Shielded!
es: ¡Protegidos!

# send.successShieldingInfo
source: Your coins have been successfully shielded
es: Tus monedas han sido protegidos con éxito

# send.failureShielding
source: Unable to shield
es: No se pudo proteger

# send.failureShieldingInfo
source: There was an error attempting to shield your coins. Try it again, please.
es: Hubo un error al intentar proteger tus monedas. Por favor, inténtalo de nuevo.

# messageEditor.addUA
source: Reply-to: Include my address in the memo
es: Responder a: Incluir mi dirección en el memo

# messageEditor.removeUA
source: Your address is included in the memo
es: Tu dirección está incluida en el memo

# messageEditor.addUAformat
source: >>> reply-to: %@
es: >>> responder a: %@

# zecKeyboard.invalid
source: This transaction amount is invalid.
es: Este monto de transacción no es válido.

# deleteWallet.title
source: Reset Zashi
es: Restablecer Zashi

# deleteWallet.message1
source: Resetting your app can lead to complete loss of access to your funds! ⚠️
es: ¡Restablecer tu aplicación puede provocar la pérdida completa de acceso a tus fondos! ⚠️

# deleteWallet.message2
source: Make sure you have both your secret recovery phrase and wallet birthday height saved before you proceed.
es: Asegúrate de haber guardado tanto tu frase de recuperación secreta como la altura de cumpleaños de la billetera antes de continuar.

# deleteWallet.message3
source: Resetting the Zashi app will delete the app database and cached app data, and disconnect all connected hardware wallets.
es: Restablecer la aplicación Zashi eliminará la base de datos y los datos en caché de la aplicación, además de desconectar todas las billeteras de hardware conectadas.

# deleteWallet.message4
source: Once you Reset Zashi, the only way to access your funds is through a wallet restore process that requires your Zashi Recovery Phrase and Wallet Birthday Height.
es: Una vez que restablezcas Zashi, la única forma de acceder a tus fondos será mediante un proceso de restauración de billetera que requiere tu Frase de Recuperación de Zashi y la Altura de Cumpleaños de la Billetera.

# deleteWallet.iUnderstand
source: I understand
es: Entiendo

# deleteWallet.actionButtonTitle
source: Reset Zashi
es: Restablecer Zashi

# deleteWallet.screenTitle
source: Reset
es: Restablecer

# notEnoughFreeSpace.title
source: Not enough free space
es: No hay suficiente espacio libre

# notEnoughFreeSpace.messagePre
source: Zashi requires %@ GB of space to synchronize the Zcash blockchain but there is only
es: Zashi requiere %@ GB de espacio para sincronizar la blockchain de Zcash, pero solo hay

# notEnoughFreeSpace.dataAvailable
source: %@ MB available.
es: %@ MB disponibles.

# notEnoughFreeSpace.messagePost
source: Syncing will stay paused until more space is available.
es: La sincronización permanecerá pausada hasta que haya más espacio disponible.

# notEnoughFreeSpace.requiredSpace
source: ~%@ MB of additional space required to continue
es: Se requieren ~%@ MB de espacio adicional para continuar.

# whatsNew.version
source: Zashi Version %@
es: Versión de Zashi %@

# settings.title
source: Settings
es: Configuración

# settings.addressBook
source: Address Book
es: Libreta de Direcciones

# settings.advanced
source: Advanced Settings
es: Configuración Avanzada

# settings.about
source: About
es: Acerca de

# settings.feedback
source: Send Us Feedback
es: Envíanos tus Comentarios

# settings.integrations
source: Integrations
es: Integraciones

# settings.recoveryPhrase
source: Zashi Recovery Phrase
es: Frase de Recuperación de Zashi

# settings.exportPrivateData
source: Export Private Data
es: Exportar Datos Privados

# settings.exportLogsOnly
source: Export logs only
es: Exportar solo registros

# settings.chooseServer
source: Choose a Server
es: Elegir un Servidor

# settings.currencyConversion
source: Currency Conversion
es: Conversión de Moneda

# settings.whatsNew
source: What's new
es: Novedades

# settings.buyZecCB
source: Buy ZEC with Coinbase
es: Comprar ZEC con Coinbase

# settings.coinbaseDesc
source: A hassle-free way to buy ZEC and get it directly into your Zashi wallet.
es: Una forma sencilla de comprar ZEC y recibirlo directamente en tu billetera Zashi.

# settings.flexa
source: Pay with Flexa
es: Pagar con Flexa

# settings.flexaDesc
source: Pay with Flexa payment clips and explore a new way of spending Zcash.
es: Paga con clips de pago de Flexa y explora una nueva forma de gastar Zcash.

# settings.restoreWarning
source: During the Restore process, it is not possible to use payment integrations.
es: Durante el proceso de Restauración, no es posible usar integraciones de pago.

# settings.deleteZashi
source: Reset Zashi
es: Restablecer Zashi

# settings.deleteZashiWarning
source: You will be asked to confirm on the next screen
es: Se te pedirá que confirmes en la siguiente pantalla

# settings.version
source: Version %@ (%@)
es: Versión %@ (%@)

# settings.alert.cantSendEmail.message
source: It looks like you don't have a default email app configured on your device. Copy the address below, and use your favorite email client to send us a message.
es: Parece que no tienes configurada una aplicación de correo predeterminada en tu dispositivo. Copia la dirección a continuación y utiliza tu cliente de correo favorito para enviarnos un mensaje.

# settings.alert.cantSendEmail.copyEmail
source: Copy %@
es: Copiar %@

# integrations.info
source: Zashi integrations provide access to third party services. Features and information shared with them are outside of our control and subject to their privacy policies.
es: Las integraciones de Zashi proporcionan acceso a servicios de terceros. Las funcionalidades y la información compartida con ellos están fuera de nuestro control y están sujetas a sus políticas de privacidad.

# sendFeedback.title
source: Send Us Feedback
es: Envíanos tus Comentarios

# sendFeedback.screenTitle
source: Support
es: Soporte

# sendFeedback.desc
source: Please let us know about any problems you have had, or features you want to see in the future.
es: Por favor, háznos saber sobre cualquier problema que hayas tenido, o funciones que te gustaría ver en el futuro.

# sendFeedback.ratingQuestion
source: How is your Zashi experience?
es: ¿Cómo ha sido tu experiencia con Zashi?

# sendFeedback.howCanWeHelp
source: How can we help you?
es: ¿Cómo podemos ayudarte?

# sendFeedback.hcwhPlaceholder
source: I would like to ask about...
es: Me gustaría preguntar sobre...

# sendFeedback.share.title
source: Support message
es: Mensaje de soporte

# sendFeedback.share.notAppleMailInfo
source: Your device doesn’t have an Apple email set up, so we prepared this message for you to send using your preferred email client. Please send this message to:
es: Tu dispositivo no tiene configurado un correo de Apple, así que preparamos este mensaje para que lo envíes usando tu cliente de correo preferido. Por favor, envía este mensaje a:

# privateDataConsent.title
source: Consent for Exporting Private Data
es: Consentimiento para Exportar Datos Privados

# privateDataConsent.message1
source: By clicking "I Agree" below, you give your consent to export all of your wallets’ private data such as the entire history of your wallet(s), including any connected hardware wallets. All private information, memos, amounts, and recipient addresses, even for your shielded activity will be exported.*
es: Al hacer clic en 'Estoy de Acuerdo', das tu consentimiento para exportar todos los datos privados de tus billeteras, como el historial completo de tus billeteras, incluyendo cualquier billetera de hardware conectada. Toda información privada, notas, montos y direcciones de destinatarios, incluso para tus actividades protegidas, serán exportadas.*

# privateDataConsent.message2
source: The private data also gives the ability to see certain future actions you take with Zashi.
es: Los datos privados también permiten ver ciertas acciones futuras que realices con Zashi.

# privateDataConsent.message3
source: Sharing this private data is irrevocable - once you have shared this private data with someone, there is no way to revoke their access.
es: Compartir estos datos privados es irrevocable: una vez que hayas compartido estos datos privados con alguien, no hay forma de revocar su acceso.

# privateDataConsent.message4
source: *Note that this private data does not give them the ability to spend your funds, only the ability to see what you do with your funds.
es: *Ten en cuenta que estos datos privados no les dan la capacidad de gastar tus fondos, solo la capacidad de ver lo que haces con tus fondos.

# privateDataConsent.confirmation
source: I agree to Zashi's Export Private Data Policies and Privacy Policy
es: Acepto las Políticas de Exportación de Datos Privados y la Política de Privacidad de Zashi

# privateDataConsent.screenTitle
source: Data Export
es: Exportación de Datos

# sync.message.uptodate
source: Up-To-Date
es: Actualizado

# sync.message.unprepared
source: Unprepared
es: No preparado

# sync.message.stopped
source: Stopped
es: Detenido

# sync.message.sync
source: %@%% Synced
es: %@%% Sincronizado

# general.back
source: Back
es: Atrás

# general.next
source: Next
es: Siguiente

# general.send
source: Send
es: Enviar

# general.share
source: Share
es: Compartir

# general.close
source: Close
es: Cerrar

# general.max
source: Max
es: Máx

# general.yes
source: Yes
es: Sí

# general.cancel
source: Cancel
es: Cancelar

# general.success
source: Success
es: Éxito

# general.unknown
source: Unknown
es: Desconocido

# general.loading
source: Loading
es: Cargando

# general.delete
source: Delete
es: Eliminar

# general.confirm
source: Confirm
es: Confirmar

# general.done
source: Done
es: Hecho

# general.save
source: Save
es: Guardar

# general.request
source: Request
es: Solicitar

# general.hide
source: Hide
es: Ocultar

# general.show
source: Show
es: Mostrar

source: QR Code for %@
es: Código QR para %@

# general.tapToCopy
source: Tap to copy
es: Toca para copiar

# general.fee
source: Typical Fee < %@
es: Tarifa Típica < %@

# general.alert.warning
source: Warning
es: Advertencia

# general.alert.continue
source: Continue
es: Continuar

# general.alert.caution
source: Heads up
es: Aviso

# general.alert.ignore
source: Ignore
es: Ignorar

# general.copiedToTheClipboard
source: Copied to the clipboard!
es: ¡Copiado al portapapeles!

# walletStatus.restoringWallet
source: RESTORING YOUR WALLET…
es: RESTAURANDO TU BILLETERA…

# walletStatus.disconnected
source: DISCONNECTED…
es: DESCONECTADO…

# transactionList.collapse
source: Collapse transaction
es: Colapsar transacción

# transactionList.messageTitle
source: Message
es: Mensaje

# transactionList.messageTitlePlural
source: Messages
es: Mensajes
