{
    "releases": [
        {
            "version": "2.0.2",
            "date": "05-08-2025",
            "timestamp": 1746692913,
            "sections": [
                {
                    "title": "Cambiado:",
                    "bulletpoints": [
                        "Al ingresar una cantidad en USD en el flujo de Enviar o Solicitar ZEC, reducimos automáticamente la cantidad de Zatoshi a los 5000 Zatoshi más cercanos para evitar la creación de notas de polvo no gastables en tu billetera.",
                        "Actualizamos la política de privacidad para que se muestre en el navegador de la app y mejore la experiencia del usuario.",
                        "Actualizamos la posición de los botones principal y secundario para seguir las mejores prácticas de UX.",
                        "Actualizamos el diseño de la pantalla Recibir para que se ajuste mejor al cambio de navegación de la app.",
                        "Después de recibir sus comentarios, actualizamos los íconos de las pantallas Enviar y Recibir en toda la app. ¿Qué les parecen ahora? ¡Cuéntanos!",
                        "Mejoramos el texto en algunos lugares.",
                        "También realizamos otros ajustes en la interfaz de usuario."
                    ]
                },
                {
                    "title": "Corregido:",
                    "bulletpoints": [
                        "Corregimos el tamaño de los botones de inicio en todos los dispositivos.",
                        "Corregimos el relleno en la pantalla Libreta de direcciones.",
                        "Corregimos un problema con las sugerencias de palabras durante el flujo de Restaurar.",
                        "También corregimos un problema con el cierre automático de la hoja inferior Gastable en ciertos casos extremos."
                    ]
                }

            ]
        },
        {
            "version": "2.0.1",
            "date": "04-25-2029",
            "timestamp": 1745926301,
            "sections": [
                {
                    "title": "Zashi 2.0.1 Actualización de corrección de errores",
                    "bulletpoints": [
                        "Solucionamos un problema que, ocasionalmente, provocaba un error al inicializar el SDK tras restablecer Zashi.",
                        "También corregímos y actualizamos texto en ciertos lugares."
                    ]
                },
                {
                    "title": "Zashi 2.0",
                    "bulletpoints": [
                        "Zashi 2.0 ya está aquí, ¡y viene repleta de mejoras de interfaz y experiencia de usuario!",
                        "Pantalla de inicio rediseñada y navegación optimizada de la app.",
                        "Nuevo widget de estado de la billetera que te ayuda a navegar por Zashi fácilmente y obtener más información con solo un toque.",
                        "Las pestañas de Saldo disponible y Saldos se han rediseñado con un nuevo componente Gastable en la pantalla de Envío. Obtén más información con solo un toque o protege tus fondos transparentes.",
                        "Restaurar nunca ha sido tan fácil con la interfaz de usuario y experiencia de usuario rediseñadas. Hemos añadido una nueva función que te ayuda a estimar la fecha de nacimiento de la billetera y sugerencias de la biblioteca BIP 39 para la frase de recuperación secreta.",
                        "¡Crea una billetera con un solo toque! El nuevo flujo de copia de seguridad de la billetera se ha trasladado a cuando tu billetera recibe sus primeros fondos."
                    ]
                }
            ]
        },
        {
            "version": "2.0",
            "date": "04-25-2025",
            "timestamp": 1745594869,
            "sections": [
                {
                    "title": "",
                    "bulletpoints": [
                        "Zashi 2.0 ya está aquí, ¡y viene repleta de mejoras de interfaz y experiencia de usuario!",
                        "Pantalla de inicio rediseñada y navegación optimizada de la app.",
                        "Nuevo widget de estado de la billetera que te ayuda a navegar por Zashi fácilmente y obtener más información con solo un toque.",
                        "Las pestañas de Saldo disponible y Saldos se han rediseñado con un nuevo componente Gastable en la pantalla de Envío. Obtén más información con solo un toque o protege tus fondos transparentes.",
                        "Restaurar nunca ha sido tan fácil con la interfaz de usuario y experiencia de usuario rediseñadas. Hemos añadido una nueva función que te ayuda a estimar la fecha de nacimiento de la billetera y sugerencias de la biblioteca BIP 39 para la frase de recuperación secreta.",
                        "¡Crea una billetera con un solo toque! El nuevo flujo de copia de seguridad de la billetera se ha trasladado a cuando tu billetera recibe sus primeros fondos."
                    ]
                }
            ]
        },
        {
            "version": "1.5.3",
            "date": "04-14-2025",
            "timestamp": 1744615242,
            "sections": [
                {
                    "title": "Corregido:",
                    "bulletpoints": [
                        "Solucionamos un problema con el flujo de transacción que se quedaba bloqueado en la pantalla de envío en caso de una verificación biométrica fallida."
                    ]
                }
            ]
        },
        {
            "version": "1.5.2",
            "date": "04-09-2025",
            "timestamp": 1744196215,
            "sections": [
                {
                    "title": "Cambiado:",
                    "bulletpoints": [
                        "Actualizamos el reporte de fallos, de tal manera que ahora solo ocuparemos los servicios de Apple, y con esto permitir a los usuarios activarlo y/o desactivarlo respectivamente en la configuración de su dispositivo.",
                        "Se ha eliminado por completo la integración con Firebase Crashlytics."
                    ]
                }
            ]
        },
        {
            "version": "1.5.1",
            "date": "04-03-2025",
            "timestamp": 1743687047,
            "sections": [
                {
                    "title": "Corregido:",
                    "bulletpoints": [
                        "¡Corrección de errores 1.5!",
                        "Solucionamos un problema de migración que afectaba a algunos usuarios de la versión 1.5 de la app.",
                        "Corregimos el icono de la dirección transparente de Keystone.",
                        "También solucionamos un problema por el cual la pantalla de inicio se bloqueaba al cargar tras tocar la billetera seleccionada."
                    ]
                }
            ]
        },
        {
            "version": "1.5",
            "date": "03-27-2025",
            "timestamp": 1742891140,
            "sections": [
                {
                    "title": "Añadido:",
                    "bulletpoints": [
                        "Rescate de Fondos Transparentes: Zashi ahora puede ayudarte a recuperar fondos desde billeteras completamente transparentes como Ledger. Recomendamos importar la frase de recuperación de tu billetera hardware transparente en una billetera Keystone y luego emparejarla con Zashi usando la integración con Keystone."
                    ]
                },
                {
                    "title": "Corregido:",
                    "bulletpoints": [
                        "Solucionamos un problema de larga data con el árbol de compromisos de notas que afectaba a un pequeño número de usuarios. Ahora Zashi permite gastar fondos que estaban atascados."
                    ]
                }
            ]
        },
        {
            "version": "1.4",
            "date": "03-03-2025",
            "timestamp": 1741028813,
            "sections": [
                {
                    "title": "Añadido:",
                    "bulletpoints": [
                        "Exporta tus transacciones del ultimo año, con la nueva opción de \"Exporta Archivo de Impuestos\".",
                        "Personaliza tus transacciones con notas privadas que te ayudan a recordar detalles de los pagos.",
                        "Marca tus transacciones favoritas con la nueva opción de \"Favoritos\".",
                        "Utiliza los nuevos filtros de transacciones para filtrar Recibidas, Enviadas, Memos, Notas o Favoritas."
                    ]
                },
                {
                    "title": "Cambiado:",
                    "bulletpoints": [
                        "Descubre la rediseñada pagina de historial de transacciones, que es más elegante y funcional.",
                        "Accede a tu KeyStone también desde la pagina de integraciones.",
                        "Mejorada experiencia de firmado de transacciones para KeyStone."
                    ]
                },
                {
                    "title": "Corregido:",
                    "bulletpoints": [
                        "No más fallos al enviar en KeyStone, parametros de Sapling han sido arreglados."
                    ]
                }
            ]
        },
        {
            "version": "1.3.3",
            "date": "02-07-2025",
            "timestamp": 1738929599,
            "sections": [
                {
                    "title": "Agregado:",
                    "bulletpoints": [
                        "Incorporamos una nueva función para firmar transacciones con un dispositivo Keystone, permitiendo ampliar el código QR al tocarlo."
                    ]
                },
                {
                    "title": "Cambiado:",
                    "bulletpoints": [
                        "Implementamos el aumento automático del brillo de la pantalla para mejorar el escaneo de códigos QR con Keystone.",
                        "Actualizamos el SDK de Keystone a la versión 0.8.6, que incluye mejoras adicionales en el escaneo de códigos QR.",
                        "También optimizamos y mejoramos la lógica de Keystone para teléfonos más antiguos y lentos."
                    ]
                },
                {
                    "title": "Arreglado:",
                    "bulletpoints": [
                        "Agregamos algunas correcciones para manejar los casos en los que el Restablecimiento de Zashi no se completa."
                    ]
                }
            ]
        },
        {
            "version": "1.3.2",
            "date": "01-09-2025",
            "timestamp": 1736420570,
            "sections": [
                {
                    "title": "Corregido:",
                    "bulletpoints": [
                        "Apariencia de los colores cuando el modo cambia (dark vs light).",
                        "Eliminado el acortamiento del texto en la pestaña de saldos.",
                        "La información en  “Novedades” ya no esta corrupta.",
                        "Las  barras de estados duplicados en la pestaña de saldos han sido removidas.",
                        "Reiniciar Zashi limpia las cuentas que están en la cache y por lo tanto las cuentas pre-seleccionadas no son validas.",
                        "La cuenta seleccionada no se encontrara dentro de la libreta de direcciones entre las cuentas posibles.",
                        "La pantalla para enviar comentarios es deslizable, haciendo posible que el botón de “Enviar” sea visible incluso en pantallas pequeñas.",
                        "El botón para reportar una falla en algún punto de la aplicación usara por default la opción de “enviar mensaje” cuando una cuenta de correo electrónico no se encuentre configurada en el teléfono mobil.",
                        "La migración a un nuevo dispositivo a travez del backup de la base de datos ahora permite al usuario entrar la altura de cumpleaños de la billetera."
                    ]
                }
            ]
        },
        {
            "version": "1.3.1",
            "date": "12-23-2024",
            "timestamp": 1734964156,
            "sections": [
                {
                    "title": "Corregido:",
                    "bulletpoints": [
                        "Error 'dataMismatch' en las transacciones de Keystone."
                    ]
                }
            ]
        },
        {
            "version": "1.3",
            "date": "12-16-2024",
            "timestamp": 1734351641,
            "sections": [
                {
                    "title": "Agregado:",
                    "bulletpoints": [
                        "La integración de Zashi con la Billetera Física Keystone esta ya disponible!",
                        "Conecta to billetera Fisica Keystone con Zashi.",
                        "Firma tus transacciones con tu billetera Keystone.",
                        "Mantén tus ZEC privados protegidos."
                    ]
                }
            ]
        },
        {
            "version": "1.2.4",
            "date": "11-25-2024",
            "timestamp": 1732369942,
            "sections": [
                {
                    "title": "Agregado:",
                    "bulletpoints": [
                        "¡Finalmente está aquí! ¡La integración de Flexa a tu servicio!",
                        "Paga con Flexa en comercios compatibles en Estados Unidos, Canadá y El Salvador.",
                        "Te está esperando en la configuración de Zashi."
                    ]
                }
            ]
        },
        {
            "version": "1.2.3",
            "date": "11-18-2024",
            "timestamp": 1731922524,
            "sections": [
                {
                    "title": "Agregado:",
                    "bulletpoints": [
                        "¡Hola!, le enseñamos a Zashi a hablar Español!",
                        "En la ultima version del SDK 2.2.7 adoptamos una nueva implementación para el manejo de transacciones de bajas denominaciones, haciendo posible transacciones mas rápidas y permitiendo un uso mas eficiente del saldo remanente en tu wallet.",
                        "Implementamos el encriptado de información y un método de almacenamiento remoto para la libreta de direcciones.",
                        "Agregamos autenticación de dispositivo al inicio de la aplicación.",
                        "Hemos añadido una barra de progreso animada y junto con ella nuevas pantallas en el caso de transacciones exitosas y/o fallidas. ¡Hemos hecho Zashi divertido otra vez!"
                    ]
                },
                {
                    "title": "Cambiado:",
                    "bulletpoints": [
                        "Hemos rediseñado las secciones de configuración y status haciéndolas mas elegantes, y hemos mejorado el nivel de seguridad de la frase de recuperación secreta (Recovery Phrase).",
                        "Nos encargamos de mejorar el proceso para mandar comentarios y sugerencias. ¡Nos importa saber que te parece Zashi y que podemos hacer para hacerlo mejor!"
                    ]
                },
                {
                    "title": "Arreglado:",
                    "bulletpoints": [
                        "Arreglamos la funcionalidad del icono para transacciones privadas (shielded) en la pantalla de historial de transacciones.",
                        "Arreglamos la funcionalidad de la linterna que congelaba la aplicación.",
                        "Y también arreglamos el problema que existía con el funcionamiento del botón de re-escaneo que no estaba funcionando correctamente."
                    ]
                }
            ]
        }
    ]
}
