{
    "releases": [
        {
            "version": "1.2.3",
            "date": "11-18-2024",
            "timestamp": 1731922524,
            "sections": [
                {
                    "title": "Added:",
                    "bulletpoints": [
                        "¡Hola!, le enseñamos a Zashi a hablar Español!",
                        "En la ultima version del SDK 2.2.7 adoptamos una nueva implementación para el manejo de transacciones de bajas denominaciones, haciendo posible transacciones mas rápidas y permitiendo un uso mas eficiente del saldo remanente en tu wallet.",
                        "Implementamos el encriptado de información y un método de almacenamiento remoto para la libreta de direcciones.",
                        "Agregamos autenticación de dispositivo al inicio de la aplicación.",
                        "Hemos añadido una barra de progreso animada y junto con ella nuevas pantallas en el caso de transacciones exitosas y/o fallidas. ¡Hemos hecho Zashi divertido otra vez!"
                    ]
                },
                {
                    "title": "Changed:",
                    "bulletpoints": [
                        "Hemos rediseñado las secciones de configuración y status haciéndolas mas elegantes, y hemos mejorado el nivel de seguridad de la frase de recuperación secreta (Recovery Phrase).",
                        "Nos encargamos de mejorar el proceso para mandar comentarios y sugerencias. ¡Nos importa saber que te parece Zashi y que podemos hacer para hacerlo mejor!"
                    ]
                },
                {
                    "title": "Fixed:",
                    "bulletpoints": [
                        "Arreglamos la funcionalidad del icono para transacciones privadas (shielded) en la pantalla de historial de transacciones.",
                        "Arreglamos la funcionalidad de la linterna que congelaba la aplicación.",
                        "Y también arreglamos el problema que existía con el funcionamiento del botón de re-escaneo que no estaba funcionando correctamente."
                    ]
                }
            ]
        }
    ]
}
